LonelyWolf/stm32/stm32l151rdt6-dev/main.c
		// Determine state of the WKUP# pins
		RCC->AHBENR |= RCC_AHBENR_GPIOAEN | RCC_AHBENR_GPIOCEN;
//		#WARNING: WHAT ERRATA SAYS ABOUT DELAY AFTER AN RCC PERIPHERAL CLOCK ENABLING?
		if (GPIOA->IDR & GPIO_IDR_IDR_0)  result |= RESET_SRC_STBY_WP1;
		if (GPIOC->IDR & GPIO_IDR_IDR_13) result |= RESET_SRC_STBY_WP2;

		// Restore value of the AHBENR register
		RCC->AHBENR = reg;
	}

	return result;
}

// Inquiry status of the button
void Button_Inquiry(BTN_TypeDef *button) {
	if (button == &BTN[BTN_ESCAPE]) {
		// Escape button have inverted input
		if (!(button->PORT->IDR & button->PIN)) {
		    // Button released
			button->hold_cntr = 0;
			if (button->state != BTN_Hold) button->cntr++;
			button->state = BTN_Released;

			// LCD debug
			lcd_changing++;
			if (lcd_changing > 2) lcd_changing = 0;

			// Disable sleep-on-exit (return to main loop from IRQ)
			SCB->SCR &= ~SCB_SCR_SLEEPONEXIT_Msk;

			BEEPER_Enable(200,1);
		} else {
			// Button pressed
			button->hold_cntr = 0;
			button->state = BTN_Pressed;
			BEEPER_Enable(2000,1);
		}
	} else {
		if (button->PORT->IDR & button->PIN) {
		    // Button released
			button->hold_cntr = 0;
			if (button->state != BTN_Hold) button->cntr++;
			button->state = BTN_Released;

			switch (lcd_changing) {
				case 0:
					// res_ratio
					if (button == &BTN[BTN_UP]) lcd_res_ratio++; else lcd_res_ratio--;
					if (lcd_res_ratio > 7) lcd_res_ratio = 0;
					break;
				case 1:
					// lcd_bias
					if (button == &BTN[BTN_UP]) lcd_lcd_bias++; else lcd_lcd_bias--;
					if (lcd_lcd_bias > 7) lcd_lcd_bias = 0;
					break;
				case 2:
					// el_vol
					if (button == &BTN[BTN_UP]) lcd_el_vol++; else lcd_el_vol--;
					if (lcd_el_vol > 63) lcd_el_vol = 0;
					break;
				default:
					break;
			}
			ST7541_Contrast(lcd_res_ratio,lcd_lcd_bias,lcd_el_vol);
			printf("ST7541: RES=%u BIAS=%u ELVOL=%u\r\n",lcd_res_ratio,lcd_lcd_bias,lcd_el_vol);

			// Disable sleep-on-exit (return to main loop from IRQ)
			SCB->SCR &= ~SCB_SCR_SLEEPONEXIT_Msk;

			BEEPER_Enable(200,1);
		} else {
			// Button pressed
			button->hold_cntr = 0;
			button->state = BTN_Pressed;
			BEEPER_Enable(2000,1);
		}
	}
}

// RTC wake-up IRQ handler
void RTC_WKUP_IRQHandler(void) {
	if (RTC->ISR & RTC_ISR_WUTF) {
		// RTC Wake-up interrupt

		// Get current date/time
		RTC_GetDateTime(&_time,&_date);

		_new_time = TRUE;

		// Disable sleep-on-exit (return to main loop from IRQ)
		SCB->SCR &= ~SCB_SCR_SLEEPONEXIT_Msk;

		PWR->CR  |= PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers enabled
		RTC->ISR &= ~RTC_ISR_WUTF; // Clear the RTC wake-up timer flag
		PWR->CR  &= ~PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers disabled

		EXTI->PR = RTC_EXTI_LINE;
	}
}

// EXTI0 line IRQ handler
void EXTI0_IRQHandler(void) {
	if (EXTI->PR & BTN3_EXTI) {
		// EXTI0 (Button#3 -> "ESCAPE")
		Button_Inquiry(&BTN[BTN_ESCAPE]);
		EXTI->PR = BTN3_EXTI; // Clear IT bit for EXTI_line
	}
}

// EXTI1 line IRQ handler
void EXTI1_IRQHandler(void) {
	nRF24_RX_PCKT_TypeDef RX_status;

	if (EXTI->PR & nRF24_IRQ_EXTI) {
		RX_status = nRF24_RXPacket(nRF24_RX_Buf,nRF24_RX_PAYLOAD);
		if (RX_status == nRF24_RX_PCKT_PIPE0) {
			_packets_rcvd++;
			_new_packet = TRUE;
		}

//		BEEPER_Enable(700,2);

		// Disable sleep-on-exit (return to main loop from IRQ)
		SCB->SCR &= ~SCB_SCR_SLEEPONEXIT_Msk;

		// Clear IT bit for EXTI_Line
		EXTI->PR = nRF24_IRQ_EXTI;
	}
}

// EXTI3 line IRQ handler
void EXTI3_IRQHandler(void) {
	if (EXTI->PR & SD_DETECT_EXTI) {
		_SD_int_cntr++;
		_SD_connected = (SD_DETECT_PORT->IDR & SD_DETECT_PIN) ? 0 : 1;
		if (_SD_connected) {
			BEEPER_PlayTones(tones_USB_con);
		} else {
			BEEPER_PlayTones(tones_USB_dis);
		}

		// Clear IT bit for EXTI_Line
		EXTI->PR = SD_DETECT_EXTI;
	}
}

// EXTI[10..15] lines IRQ handler
void EXTI15_10_IRQHandler(void) {
	uint16_t acc_irq;

/*
	// EXTI10 of USB sense conflicts with EXTI10 of button "UP"
	if (EXTI->PR & USB_SENS_EXTI) {
		// USB sense pin
		_USB_int_cntr++;
		_USB_connected = (USB_SENS_PORT->IDR & USB_SENS_PIN) ? 1 : 0;
		if (_USB_connected) {
			BEEPER_PlayTones(tones_USB_con);
		} else {
			BEEPER_PlayTones(tones_USB_dis);
		}
		EXTI->PR = USB_SENS_EXTI; // Clear IT bit for EXTI_Line
	}
*/

	if (EXTI->PR & ACC_IRQ_EXTI) {
		// Accelerometer IRQ pin
		acc_irq = BMC050_ACC_GetIRQStatus(); // <--- Bad idea to call this in IRQ handler
		if (acc_irq & ACC_IRQ_SLOPE) {
			// Slope IRQ high
			BEEPER_Enable(444,1);
		} else {
			// Slope IRQ low
			BEEPER_Enable(3333,1);
		}
		printf("---> ACC IRQ: [%s] <---\r\n",(acc_irq & ACC_IRQ_SLOPE) ? "HIGH" : "LOW");
		EXTI->PR = ACC_IRQ_EXTI; // Clear IT bit for EXTI_line
	}

	if (EXTI->PR & BTN0_EXTI) {
		// EXTI10 (Button#0 -> "UP")
		Button_Inquiry(&BTN[BTN_UP]);
		EXTI->PR = BTN0_EXTI; // Clear IT bit for EXTI_line
	}

	if (EXTI->PR & BTN1_EXTI) {
		// EXTI11 (Button#1 -> "DOWN")
		Button_Inquiry(&BTN[BTN_DOWN]);
		EXTI->PR = BTN1_EXTI; // Clear IT bit for EXTI_line
	}

	if (EXTI->PR & BTN2_EXTI) {
		// EXTI15 (Button#2 -> "ENTER")
		Button_Inquiry(&BTN[BTN_ENTER]);
		EXTI->PR = BTN2_EXTI; // Clear IT bit for EXTI_line
	}
}

// SDIO IRQ handler
void SDIO_IRQHandler(void) {
	printf("\r\n###> IRQ SDIO [%X] CNT=%u\r\n",SDIO->STA,SDIO->FIFOCNT);

	// Clear SDIO interrupt bit
//	SDIO->ICR = 0x00FFFFFF;
	SDIO->ICR = SDIO_ICR_TXUNDERRC;
}

// DMA2 channel4 IRQ handler (SDIO DMA)
void DMA2_Channel4_IRQHandler(void) {
	uint32_t cntr;

	cntr = SDIO_DMA_CH->CNDTR;
	printf("\r\n###> IRQ DMA2 [%X] [%u]\r\n",DMA2->ISR,cntr);

	// Clear DMA interrupt bits
	DMA2->IFCR = DMA_IFCR_CGIF4 | DMA_IFCR_CHTIF4 | DMA_IFCR_CTCIF4 | DMA_IFCR_CTEIF4;
}

// Compute interquartile mean from array of values
uint32_t InterquartileMean(uint16_t *array, uint32_t numOfSamples) {
	uint32_t sum=0;
	uint32_t index, maxindex;

	// discard the lowest and the highest data samples
	maxindex = 3 * numOfSamples / 4;
	for (index = (numOfSamples / 4); index < maxindex; index++) {
		sum += array[index];
	}
	// return the mean value of the remaining samples value

