LonelyWolf/stm32/stm32l151rdt6-dev/main.c
/*
	// Enable the USB sense pin interrupt
	NVICInit.NVIC_IRQChannel = USB_SENS_EXTI_N;
	NVICInit.NVIC_IRQChannelPreemptionPriority = 2;
	NVICInit.NVIC_IRQChannelSubPriority = 0;
	NVICInit.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVICInit);
*/

	// Simple enable the USB sense pin interrupt
//	NVIC_EnableIRQ(USB_SENS_EXTI_N);

	_USB_connected = (USB_SENS_PORT->IDR & USB_SENS_PIN) ? 1 : 0;

/*
	if (_USB_connected) {
		// Configure the USB peripheral
		USB_HWConfig();
		// Initialize the USB device
		USB_Init();
	}
*/




	// Buttons initialization
	for (i = 0; i < 4; i++) memset(&BTN[i],0,sizeof(BTN[i]));
	BTN[0].PORT  = BTN0_PORT;
	BTN[0].PIN   = BTN0_PIN;
	BTN[0].EXTIn = BTN0_EXTI;

	BTN[1].PORT  = BTN1_PORT;
	BTN[1].PIN   = BTN1_PIN;
	BTN[1].EXTIn = BTN1_EXTI;

	BTN[2].PORT  = BTN2_PORT;
	BTN[2].PIN   = BTN2_PIN;
	BTN[2].EXTIn = BTN2_EXTI;

	BTN[3].PORT  = BTN3_PORT;
	BTN[3].PIN   = BTN3_PIN;
	BTN[3].EXTIn = BTN3_EXTI;

	// Enable button GPIOx peripherals (pins where buttons connected)
	RCC->AHBENR |= BTN0_PERIPH | BTN1_PERIPH | BTN2_PERIPH | BTN3_PERIPH;

	PORT.GPIO_Speed = GPIO_Speed_2MHz;
	PORT.GPIO_Mode  = GPIO_Mode_IN;
	PORT.GPIO_PuPd  = GPIO_PuPd_NOPULL;

	// Button#0 (PB10)
	PORT.GPIO_Pin = BTN0_PIN;
	GPIO_Init(BTN0_PORT,&PORT);
	// Button#1 (PB11)
	PORT.GPIO_Pin = BTN1_PIN;
	GPIO_Init(BTN1_PORT,&PORT);
	// Button#2 (PA15)
	PORT.GPIO_Pin = BTN2_PIN;
	GPIO_Init(BTN2_PORT,&PORT);
	// Button#3 (PA0)
	PORT.GPIO_Pin = BTN3_PIN;
	GPIO_Init(BTN3_PORT,&PORT);

	// Configure buttons the EXTI lines
	// Button#0
	EXTI->PR    =  BTN0_EXTI; // Clear IT pending bit for EXTI
	EXTI->IMR  |=  BTN0_EXTI; // Enable interrupt request from EXTI
	EXTI->EMR  &= ~BTN0_EXTI; // Disable event on EXTI
	EXTI->RTSR |=  BTN0_EXTI; // Trigger rising edge enabled
	EXTI->FTSR |=  BTN0_EXTI; // Trigger falling edge enabled
	// PB10 as source input for EXTI10
	SYSCFG->EXTICR[2] &= ~SYSCFG_EXTICR3_EXTI10; // Clear bits (Set PA10 pin as input source)
	SYSCFG->EXTICR[2] |=  SYSCFG_EXTICR3_EXTI10_PB; // Set PB10 pin as input source

	// Button#1
	EXTI->PR    =  BTN1_EXTI; // Clear IT pending bit for EXTI
	EXTI->IMR  |=  BTN1_EXTI; // Enable interrupt request from EXTI
	EXTI->EMR  &= ~BTN1_EXTI; // Disable event on EXTI
	EXTI->RTSR |=  BTN1_EXTI; // Trigger rising edge enabled
	EXTI->FTSR |=  BTN1_EXTI; // Trigger falling edge enabled

	// PB11 as source input for EXTI11
	SYSCFG->EXTICR[2] &= ~SYSCFG_EXTICR3_EXTI11; // Clear bits (Set PA11 pin as input source)
	SYSCFG->EXTICR[2] |=  SYSCFG_EXTICR3_EXTI11_PB; // Set PB11 pin as input source

	// Button#2
	EXTI->PR    =  BTN2_EXTI; // Clear IT pending bit for EXTI
	EXTI->IMR  |=  BTN2_EXTI; // Enable interrupt request from EXTI
	EXTI->EMR  &= ~BTN2_EXTI; // Disable event on EXTI
	EXTI->RTSR |=  BTN2_EXTI; // Trigger rising edge enabled
	EXTI->FTSR |=  BTN2_EXTI; // Trigger falling edge enabled

	// PA15 as source input for EXTI15
	SYSCFG->EXTICR[3] &= ~SYSCFG_EXTICR4_EXTI15; // Clear bits (Set PA15 pin as input source)
	// In fact this is not necessary because it is the default condition after reset
	SYSCFG->EXTICR[3] |=  SYSCFG_EXTICR4_EXTI15_PA; // Set PA15 pin as input source

	// Button#3
	EXTI->PR    =  BTN3_EXTI; // Clear IT pending bit for EXTI
	EXTI->IMR  |=  BTN3_EXTI; // Enable interrupt request from EXTI
	EXTI->EMR  &= ~BTN3_EXTI; // Disable event on EXTI
	EXTI->RTSR |=  BTN3_EXTI; // Trigger rising edge enabled
	EXTI->FTSR |=  BTN3_EXTI; // Trigger falling edge enabled

	// PA0 as source input for EXTI0
	SYSCFG->EXTICR[0] &= ~SYSCFG_EXTICR1_EXTI0; // Clear bits (Set PA0 pin as input source)
	// In fact this is not necessary because it is the default condition after reset
	SYSCFG->EXTICR[0] |=  SYSCFG_EXTICR1_EXTI0_PA; // Set PA0 pin as input source

	// Simple enable the button pins interrupts
	NVIC_EnableIRQ(BTN0_EXTI_N);
	NVIC_EnableIRQ(BTN1_EXTI_N);
	NVIC_EnableIRQ(BTN2_EXTI_N);
	NVIC_EnableIRQ(BTN3_EXTI_N);




	// For debug purposes
	if (CoreDebug->DHCSR & CoreDebug_DHCSR_C_DEBUGEN_Msk) {
		// Application executed under debugger control
		BEEPER_Enable(333,3);
		Delay_ms(500);
	} else {
		if (_reset_source & RESET_SRC_STBY) {
			// Device has been in STANDBY mode
			BEEPER_Enable(4000,3);
		} else {
			// Device has not been in STANDBY mode
			BEEPER_Enable(1000,3);
		}
		Delay_ms(2000);
	}




	// Reset or wake-up source
	if (_reset_source == RESET_SRC_UNKNOWN) {
		printf("Wakeup: [UNKNOWN]\r\n");
	} else {
		printf("Wakeup: %s%s%s%s%s%s\r\n",
				_reset_source & RESET_SRC_PIN      ? "PIN " : "",
				_reset_source & RESET_SRC_POR      ? "POR/PDR " : "",
				_reset_source & RESET_SRC_SOFT     ? "SOFT " : "",
				_reset_source & RESET_SRC_STBY     ? "STBY " : "",
				_reset_source & RESET_SRC_STBY_WP1 ? "WKUP1 " : "",
				_reset_source & RESET_SRC_STBY_WP2 ? "WKUP2 " : ""
				);
	}




	// System core clock
	i = SystemCoreClock;
	printf("CPU: %u.%03uMHz\r\n",i / 1000000,(i / 1000) % 1000);
/*
	RCC_ClocksTypeDef RCC_Clocks;
	RCC_GetClocksFreq(&RCC_Clocks);
	printf("RCC: HCLK=%u PCLK1=%u PCLK2=%u SYSCLK=%u\r\n",
			RCC_Clocks.HCLK_Frequency,
			RCC_Clocks.PCLK1_Frequency,
			RCC_Clocks.PCLK2_Frequency,
			RCC_Clocks.SYSCLK_Frequency);
*/




	// Debugger report
	printf("Core debugger: %s\r\n",(CoreDebug->DHCSR & CoreDebug_DHCSR_C_DEBUGEN_Msk) ? "PRESENT" : "NONE");




	// Configure charger STAT pin
	RCC->AHBENR |= CHRG_STAT_PERIPH; // Enable charger STAT pin port peripheral

	// Configure GPIO pin as input with pull-up
	CHRG_STAT_PORT->MODER &= ~GPIO_MODER_MODER2; // Input mode (reset state)
	CHRG_STAT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR2; // Floating (clear bits)
	CHRG_STAT_PORT->PUPDR |=  GPIO_PUPDR_PUPDR2_0; // Pull-up




	// Configure SD detect pin
	RCC->AHBENR |= SD_DETECT_PERIPH; // Enable SD detect pin port peripheral

	// ------------ WARNING -------------
	// PB3 mapped as JTDO after reset, it must be switched to GPIO function here!
	// ------------ WARNING -------------

	/////////////////////////////////////////////////////////////////////////////////////////////
	// To use the serial wire DP to release some GPIOs, the user software must change the GPIO //
	// (PA15, PB3 and PB4) configuration mode in the GPIO_MODER register. This releases        //
	// PA15, PB3 and PB4 which now become available as GPIOs.                                  //
	/////////////////////////////////////////////////////////////////////////////////////////////

	// Configure GPIO pin as input with pull-up
	SD_DETECT_PORT->MODER &= ~GPIO_MODER_MODER3; // Input mode (reset state)
	SD_DETECT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR3; // Floating (clear bits)

