LonelyWolf/stm32/stm32l151rdt6-dev/main.c
			total_space = vi.numclusters * vi.clustersize;
			free_space  = cfree * vi.clustersize;
			used_space  = (vi.numclusters - cfree) * vi.clustersize;

			printf("Used space: %10ub [%uMB]\r\n",used_space,used_space / 1048576);
			printf("Free space: %10ub [%uMB]\r\n",free_space,free_space / 1048576);
			printf("Capacity  : %10ub [%uMB]\r\n",total_space,total_space / 1048576);

			di.scratch = sector;

			// List files in root directory of SD card
			if (DFS_OpenDir(&vi,(uint8_t *)"",&di)) {
				printf("Error opening root directory.\r\n");
			} else {
				while (!DFS_GetNext(&vi,&di,&de)) {
					if (de.name[0]) {
						// Warning: there is no zero terminator in name
						printf("file: \"%s\" [%c%c%c%c%c] %10u\r\n",
								de.name,
								(de.attr & ATTR_DIRECTORY) ? 'D' : '-',
								(de.attr & ATTR_READ_ONLY) ? 'R' : '-',
								(de.attr & ATTR_HIDDEN)    ? 'H' : '-',
								(de.attr & ATTR_SYSTEM)    ? 'S' : '-',
								(de.attr & ATTR_ARCHIVE)   ? 'A' : '-',
								(de.filesize_3 << 24) | (de.filesize_2 << 16) | (de.filesize_1 << 8) | de.filesize_0);
					}
				}
			}

			// List files in LOG directory
			if (DFS_OpenDir(&vi,(uint8_t *)LOG_DIR_LOGS,&di)) {
				printf("Error opening \".\\%s\" directory.\r\n",LOG_DIR_LOGS);
			} else {
				while (!DFS_GetNext(&vi,&di,&de)) {
					if (de.name[0]) {
						// Warning: there is no zero terminator in name
						printf("file: \"%s\" [%c%c%c%c%c] %10u\r\n",
								de.name,
								(de.attr & ATTR_DIRECTORY) ? 'D' : '-',
								(de.attr & ATTR_READ_ONLY) ? 'R' : '-',
								(de.attr & ATTR_HIDDEN)    ? 'H' : '-',
								(de.attr & ATTR_SYSTEM)    ? 'S' : '-',
								(de.attr & ATTR_ARCHIVE)   ? 'A' : '-',
								(de.filesize_3 << 24) | (de.filesize_2 << 16) | (de.filesize_1 << 8) | de.filesize_0);
					}
				}
			}
		}

		// END OF SD CARD THESTS
	}




    printf("---------------------------------------------\r\n");




	BEEPER_Enable(2500,1);




	// Measure LCD performance
	RCC->AHBENR |= RCC_AHBENR_DMA1EN; // Enable the DMA1 peripheral clock

	// GFX Demo (rotozoomer with checkerboard or XOR texture)
	float ca,sa;
	float scalee = 0.5;
	float dscalee = 0.05;
	float angle = 0.0;
	float x,y;
	float xrow = 0.0;
	float yrow = 0.0;

    RTC_SetWakeUp(10);
    _new_time = FALSE;
    ST7541_Fill(0x0000);
	while(1) {
		ca = scalee * cosf(angle);
		sa = scalee * sinf(angle);
		xrow = sa;
		yrow = ca;
		for (j = 16; j < 127; j++) {
			x = xrow;
			y = yrow;
			for (i = 0; i < 127; i++) {
				x += ca;
				y += sa;
				if (lcd_changing % 2) {
					Pixel(i,j,((((int8_t)x >> 3) & 1) ^ (((int8_t)y >> 3) & 1)) ? gs_black : gs_white); // Black and white checker board
				} else {
					Pixel(i,j,(((int8_t)x >> 3) & 3) ^ (((int8_t)y >> 3) & 3)); // 2-bit XOR texture
				}
			}
			xrow += -sa;
			yrow +=  ca;
		}
		angle += 0.05;
		scalee += ((scalee <= 0.10) || (scalee >= 1.3)) ? dscalee *= -1: dscalee;

		Rect(0,16,127,127,gs_black);
		FillRect(0,0,127,15,gs_white);

		// Draw FPS with shadow effect
		lcd_color = gs_ltgray;
		i = PutIntF(4,4,d0,1,fnt7x10) + 4;
		PutStr(i,4,"FPS",fnt7x10);
		lcd_color = gs_dkgray;
		i = PutIntF(3,3,d0,1,fnt7x10) + 4;
		PutStr(i,3,"FPS",fnt7x10);
		lcd_color = gs_black;
		i = PutIntF(2,2,d0,1,fnt7x10) + 4;
		PutStr(i,2,"FPS",fnt7x10);

		ST7541_Flush_DMA();
		k++;

		if (_new_time) {
			d0 = k;
			_new_time = FALSE;
			k = 0;
		}
	}

    ST7541_Fill(0x0000);
	k = 0;
    for (i = 0; i < 8; i++) {
		d0 = 16 + (i * 12);
    	for (j = 0; j < 8; j++) {
    		d1 = 29 + (j * 12);
    		FillRect(d0,d1,d0 + 11,d1 + 11,(k) ? gs_white : gs_ltgray);
    		Rect(d0,d1,d0 + 11,d1 + 11,gs_black);
    		k = !k;
    	}
    	k = !k;
    }
    Rect(0,0,127,127,gs_black);

    RTC_SetWakeUp(10);
    _new_time = FALSE;
	while(1) {
		k = 0;
		while (!_new_time) {
			ST7541_Flush_DMA();
//			ST7541_Flush();
			k++;
		}
		FillRect(2,2,63,12,gs_white);
		i = PutIntF(2,2,k,1,fnt7x10) + 2;
		PutStr(i,2,"FPS",fnt7x10);
		printf("DTM: %s, %02u:%02u:%02u %02u.%02u.20%02u\r\n",
				sDOW[_date.RTC_WeekDay - 1],
				_time.RTC_Hours,
				_time.RTC_Minutes,
				_time.RTC_Seconds,
				_date.RTC_Date,
				_date.RTC_Month,
				_date.RTC_Year
			);
		printf("FPS = %u.%u\r\n",k / 10,k % 10);
		_new_time = FALSE;
	}
	// Results with 125kHz
	// ST7541_data :   3.8FPS
	// SPIx_SendBuf:   3.8FPS
	// DMA         :   3.8FPS

	// Result with 8MHz
	// ST7541_data :  57.4FPS
	// SPIx_SendBuf: 149.9FPS
	// DMA         : 243.0FPS

	// Results with 16MHz
	// ST7541_data :  64.5FPS
	// SPIx_SendBuf: 149.9FPS
	// DMA         : 430.2FPS <-- FAIL




	while(1) {
		// Date/time
		RTC_GetDateTime(&_time,&_date);
		printf("DTM: %s, %02u:%02u:%02u %02u.%02u.20%02u\r\n",
				sDOW[_date.RTC_WeekDay - 1],
				_time.RTC_Hours,
				_time.RTC_Minutes,
				_time.RTC_Seconds,
				_date.RTC_Date,
				_date.RTC_Month,
				_date.RTC_Year
			);

//		printf("BTN: #0 IDR=%s\r\n",(GPIOB->IDR & GPIO_Pin_10) ? "HI" : "LOW");
//		printf("BTN: #1 IDR=%s\r\n",(GPIOB->IDR & GPIO_Pin_11) ? "HI" : "LOW");
//		printf("BTN: #2 IDR=%s\r\n",(GPIOA->IDR & GPIO_Pin_15) ? "HI" : "LOW");
//		printf("BTN: #3 IDR=%s\r\n",(GPIOA->IDR & GPIO_Pin_0)  ? "HI" : "LOW");

		// Buttons
		for (i = 0; i < 4; i++) {
			printf("BTN: #%u CNTR=%u HOLD=%u STATE=%02X IDR=%s\r\n",
					i,
					BTN[i].cntr,
					BTN[i].hold_cntr,
					BTN[i].state,
					(BTN[i].PORT->IDR & BTN[i].PIN) ? "HI" : "LOW");
		}

		// Measure Vbat
/*
		// Do 16 ADC measurements and calculate rough average
		ADC1_raw = 0;
		Vrefint_raw = 0;
		for (i = 0; i < 16; i++) {
			ADC1->CR2 |= ADC_CR2_JSWSTART; // Start conversion of injected channels
			while (!(ADC1->SR & ADC_SR_JEOC)); // Wait until ADC conversions end
			ADC1_raw    += ADC1->JDR1; // Read injected data register1 (ADC_IN1)
			Vrefint_raw += ADC1->JDR2; // Read injected data register2 (ADC_IN17)
			if (i) {
				ADC1_raw >>= 1;
				Vrefint_raw >>= 1;
			}
			ADC1->SR &= ~ADC_SR_JEOC; // Clear JEOC bit (is this necessary?)
		}
*/

		// Do 16 ADC measurements
		for (i = 0; i < 16; i++) {
			ADC1->CR2 |= ADC_CR2_JSWSTART; // Start conversion of injected channels
			while (!(ADC1->SR & ADC_SR_JEOC)); // Wait until ADC conversions end
			ADC1_raws[i]    = ADC1->JDR1; // Read injected data register1 (ADC_IN1)
			Vrefint_raws[i] = ADC1->JDR2; // Read injected data register2 (ADC_IN17)
		}
		// Calculate interquartile mean values of ADC readings
		ADC1_raw = InterquartileMean(ADC1_raws,16);
		Vrefint_raw = InterquartileMean(Vrefint_raws,16);

		// Convert ADC readings to voltage
		Vbat = (uint16_t)(((*VREFINT_CAL * ADC1_raw * 3.0)/(Vrefint_raw * 4095.0)) * 1000);
		Vrefint = (uint16_t)(((Vrefint_raw * 3.0) / 4095.0) * 1000);
		Vcpu = (uint16_t)(((*VREFINT_CAL * 3.0) / Vrefint_raw) * 1000);
		printf("VOL: Bat=[%u.%03uV -> %u.%03uV] Ref=%u.%03uV CPU=%u.%03uV\r\n",
				(unsigned int)Vbat / 1000, (unsigned int)Vbat % 1000,
				((unsigned int)Vbat / 1000) * 2, ((unsigned int)Vbat % 1000) * 2,
				(unsigned int)Vrefint / 1000, (unsigned int)Vrefint % 1000,
				(unsigned int)Vcpu / 1000, (unsigned int)Vcpu % 1000);

